app/controllers/posts_controller.rb

  def index
    @user = current_user
    @post = Post.new
    posts = @user.posts.map {|post| post}
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "teste"], ["user_id", 1], ["created_at", "2017-12-17 23:21:05.233621"], ["updated_at", "2017-12-17 23:21:05.233621"]]